## The **Basics** üêº

In [1]:
import pandas as pd

### Creating a sample DataFrame

In [3]:
data = {'Name': ['Nirmit', 'Akash', 'Rohit'], 'Age': [22, 21, 22]}
df = pd.DataFrame(data)

df.head()

     Name  Age
0  Nirmit   22
1   Akash   21
2   Rohit   22

### **Puzzle 1**
Select a column from a DataFrame.

In [4]:
ages = df['Age']

ages

0    22
1    21
2    22
Name: Age, dtype: int64

### **Puzzle 2**
Select multiple columns from a DataFrame.

In [7]:
name_age = df[['Name', 'Age']]

name_age

     Name  Age
0  Nirmit   22
1   Akash   21
2   Rohit   22

### **Puzzle 3**
Add a new column to a DataFrame.

In [11]:
df['City'] = ['Gorakhpur', 'Lucknow', 'Kanpur']

df.head()

     Name  Age       City
0  Nirmit   22  Gorakhpur
1   Akash   21    Lucknow
2   Rohit   22     Kanpur

### **Puzzle 4**
Drop a column from a DataFrame.

In [13]:
df = df.drop(['City'], axis=1)

df.head()

     Name  Age
0  Nirmit   22
1   Akash   21
2   Rohit   22

### **Puzzle 5**
Sort a DataFrame by a column.

In [15]:
df_sorted = df.sort_values(by='Age', ascending=False)

df_sorted.head()

     Name  Age
0  Nirmit   22
2   Rohit   22
1   Akash   21

### **Puzzle 6**
Filter a DataFrame by a condition.

In [19]:
df_filtered = df[df['Age'] == 21]

df_filtered

    Name  Age
1  Akash   21

### **Puzzle 7**
Calculate the mean of a column.

In [24]:
df['Age'].mean().round(2)

21.67

### **Puzzle 8**
Group a DataFrame by a column and calculate the sum.

In [25]:
df.groupby(['Age']).sum()

            Name
Age
21         Akash
22   NirmitRohit

In [ ]:
# Feel free to code ...